Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Изменилась количество";

	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

// Пересчет суммы.
// 
// Параметры:
//  СтрокаТовары - ДанныеФормыЭлементКоллекции - Строка товары
//  СообщениеПользователю - Строка - Сообщение пользователю
&НаКлиенте
Процедура ПересчетСуммы(СтрокаТовары, СообщениеПользователю) Экспорт

	СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;
	Сообщить(СообщениеПользователю);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстСообщения = "Изменилась цена";
	
	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);
	
	Пользователь = ОписаниеПользовтеля();
	
	Сообщить(Пользователь.ДатаРождения);
	
КонецПроцедуры

// Описание пользовтеля.
// 
// Возвращаемое значение:
//  Структура - Описание пользовтеля:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатаный - Булево - 
&НаКлиенте
Функция ОписаниеПользовтеля()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатаный", Истина);
	
	Возврат Человек;
	
КонецФункции
